rails-backend/app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
  def index
    @recipes = Recipe.all
    render json: {recipes: Recipe.all.map{ |recipe| format_recipe(recipe) }}

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "recipes" ("name", "link", "notes", "status", "is_favorited", "created_at", "updated_at", "user_id", "img_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "recipes".* FROM "recipes"
---
  def submit
    # find user from the user id then
    @recipe = Recipe.new(recipe_params)
    @user = User.find(recipe_params[:user_id])
    @recipe.user = @user
    if @recipe.valid?
      @recipe.save!
      render json: {recipes: Recipe.all.map{ |recipe| format_recipe(recipe) }}

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "recipes" SET "status" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["status", 1], ["updated_at", "2020-06-24 21:10:35.875074"], ["id", 4]]
SELECT "recipes".* FROM "recipes"
---
  def change_status
    @recipe = Recipe.find(recipe_params[:id])
    @recipe.update(status: recipe_params[:status])
    render json: {recipes: Recipe.all.map { |recipe| format_recipe(recipe)}}

DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 5]]
SELECT "recipes".* FROM "recipes"
---
  def destroy
    Recipe.destroy(recipe_params[:id])
    render json: {recipes: Recipe.all.map{ |recipe| format_recipe(recipe) }}