rails-backend/app/controllers/users_controller.rb

  def signup
    @user = User.create(user_params)
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "1"], ["created_at", "2020-06-22 19:35:32.506837"], ["updated_at", "2020-06-22 19:35:32.506837"]]